src/notes/the-worst-week.org
#+TITLE: The Worst Week
#+DATE: 2006-07-12
#+OPTIONS: toc:nil

1. Despite having so many successful stories in the bag, Agni III failed to hit the target. It was designed to hit a target at 3000 km (approximately 1900 miles).

2. INSAT-4C failed at launch. We have launched 7 similar satellites in the past and 3-4 for other countries, but this time we failed. It was carrying a payload of around 2 tonnes. Although some news outlets are saying it exploded, ISRO is saying that it was designed to self-destruct if it deviated from its trajectory by more than 10 degrees. So when it deviated, the destruct command was sent to the main computer.

3. Yesterday, 7 serial bombs blew up trains on the Mumbai Western Line, killing almost 200 people and injuring around 500 others. This is the worst blast after the 1993 blasts, which killed around 250 people.

But yes, these things cannot break us. There are many success stories to cherish. We will overcome all this and emerge with new strength.
