docs/notes/the-worst-week.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!--  -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>The Worst Week</title>
<meta name="author" content="Pankaj Jangid" />
<meta name="description" content="A difficult week for India's space program when Agni III missed its 3000 km target and INSAT-4C was lost at launch. A short note on what ambitious engineering actually costs when things go wrong." />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../css/main.css" />

<link rel="canonical" href="https://jangid.info/notes/the-worst-week.html"/>
<meta name="description" content="A difficult week for India&apos;s space program when Agni III missed its 3000 km target and INSAT-4C was lost at launch. A short note on what ambitious engineering actually costs when things go wrong."/>
<meta property="og:type" content="article"/>
<meta property="og:site_name" content="Pankaj Jangid"/>
<meta property="og:title" content="The Worst Week"/>
<meta property="og:description" content="A difficult week for India&apos;s space program when Agni III missed its 3000 km target and INSAT-4C was lost at launch. A short note on what ambitious engineering actually costs when things go wrong."/>
<meta property="og:url" content="https://jangid.info/notes/the-worst-week.html"/>
<meta name="twitter:card" content="summary"/>
<meta name="twitter:site" content="@jangid"/>
<meta name="twitter:title" content="The Worst Week"/>
<meta name="twitter:description" content="A difficult week for India&apos;s space program when Agni III missed its 3000 km target and INSAT-4C was lost at launch. A short note on what ambitious engineering actually costs when things go wrong."/>
<link rel="alternate" type="application/rss+xml" title="Pankaj Jangid — Notes" href="/notes/feed.xml"/>
</head>
<body>
<div id="preamble" class="status">
<nav class="site-nav"><a href="/">Home</a><a href="/notes/">Notes</a></nav>
</div>
<div id="content" class="content">
<p class="eyebrow"><a href="/notes/tags/governance.html">governance</a><span class="sep">·</span><a href="/notes/tags/india.html">india</a></p><h1 class="title">The Worst Week</h1><p class="byline">Published 12 Jul 2006</p>
<ol class="org-ol">
<li>Despite having so many successful stories in the bag, Agni III failed to hit the target. It was designed to hit a target at 3000 km (approximately 1900 miles).</li>

<li>INSAT-4C failed at launch. We have launched 7 similar satellites in the past and 3-4 for other countries, but this time we failed. It was carrying a payload of around 2 tonnes. Although some news outlets are saying it exploded, ISRO is saying that it was designed to self-destruct if it deviated from its trajectory by more than 10 degrees. So when it deviated, the destruct command was sent to the main computer.</li>

<li>Yesterday, 7 serial bombs blew up trains on the Mumbai Western Line, killing almost 200 people and injuring around 500 others. This is the worst blast after the 1993 blasts, which killed around 250 people.</li>
</ol>

<p>
But yes, these things cannot break us. There are many success stories to cherish. We will overcome all this and emerge with new strength.
</p>
</div>
<div id="postamble" class="status">
<nav class="prev-next"><a class="newer" href="./moving-on.html"><span class="label">Newer</span><span class="title">&larr; Moving On</span></a><a class="older" href="./chicago-downtown-trip.html"><span class="label">Older</span><span class="title">Chicago Downtown Trip &rarr;</span></a></nav><div class="site-footer"><span><a href="mailto:pankaj@jangid.info">pankaj@jangid.info</a></span><span class="sep">·</span><span><a href="https://x.com/jangid" rel="me">X</a></span><span class="sep">·</span><span><a href="https://www.linkedin.com/in/pankaj-jangid/" rel="me">LinkedIn</a></span><span class="sep">·</span><span><a href="https://github.com/jangid" rel="me">GitHub</a></span></div><div class="legal">&copy; 2005&ndash;2026 Pankaj Jangid. Prose licensed under <a href="https://creativecommons.org/licenses/by/4.0/">CC BY 4.0</a>; code snippets under the MIT License.</div>
</div>
</body>
</html>
